# macOS packages managed by Homebrew
# Usage: brew bundle --file=config/Brewfile --no-lock

# --- Taps ---
tap "dotenvx/brew"
tap "FelixKratz/formulae"
tap "trasta298/tap"
tap "oven-sh/bun"

# --- Shell & Terminal ---
brew "tmux"
brew "starship"
brew "sheldon"
brew "atuin"
brew "zoxide"
brew "joshmedeski/sesh/sesh"  # Smart tmux session manager (fuzzy finder + zoxide/ghq integration)
brew "stow"
brew "aerc"

# --- Image Processing ---
brew "imagemagick"
brew "qrencode"

# --- Development ---
brew "neovim"
brew "typst"
brew "fancy-cat"    # ターミナル内PDFビューア（Kitty graphics protocol）
brew "lazygit"
brew "trasta298/tap/keifu"
brew "lazydocker"
brew "git-delta"
brew "gh"
brew "ghq"
brew "mise"
brew "uv"
brew "rust"
brew "oven-sh/bun/bun"
brew "dotenvx/brew/dotenvx"

# --- Development Workflow ---
brew "direnv"
brew "just"
brew "watchexec"
brew "hyperfine"

# --- Database ---
brew "pgcli"         # PostgreSQL用インタラクティブクライアント（オートコンプリート・シンタックスハイライト）
brew "rainfrog"      # TUIデータベースクライアント（Rust製、Vimキーバインド対応）
brew "postgresql@17" # psqlクライアント + pg_dump/pg_restore（Docker内のDBに接続するため）

# --- Security ---
brew "gitleaks"

# --- Modern CLI tools ---
brew "eza"
brew "lsd"
brew "bat"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "yazi"
brew "tokei"
brew "tealdeer"
brew "procs"
brew "sd"
brew "dust"
brew "bottom"
brew "rip2"
brew "fastfetch"
brew "xh"
brew "git-absorb"
brew "ouch"
brew "glow"
brew "viddy"
brew "doggo"
brew "topgrade"
brew "grex"

# --- System Monitoring ---
brew "macmon"      # Apple Silicon GPU/CPU monitoring (tmux status bar)

# --- macOS UI ---
brew "sketchybar"
brew "borders"

# --- Casks ---
cask "ghostty"
cask "raycast"
cask "karabiner-elements"
cask "aerospace"
cask "font-sketchybar-app-font"
