# macOS packages managed by Homebrew
# Usage: brew bundle --file=config/Brewfile --no-lock

# --- Taps ---
tap "dotenvx/brew"
tap "FelixKratz/formulae"

# --- Shell & Terminal ---
brew "tmux"
brew "starship"
brew "sheldon"
brew "atuin"
brew "zoxide"
brew "stow"

# --- Development ---
brew "neovim"
brew "lazygit"
brew "lazydocker"
brew "git-delta"
brew "gh"
brew "ghq"
brew "mise"
brew "uv"
brew "rust"
brew "dotenvx/brew/dotenvx"

# --- Modern CLI tools ---
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "yazi"
brew "tokei"
brew "tealdeer"
brew "procs"
brew "sd"
brew "dust"
brew "bottom"
brew "rip2"
brew "fastfetch"

# --- System Monitoring ---
brew "macmon"      # Apple Silicon GPU/CPU monitoring (tmux status bar)

# --- macOS UI ---
brew "sketchybar"
brew "borders"

# --- Casks ---
cask "ghostty"
cask "raycast"
cask "karabiner-elements"
cask "aerospace"
cask "font-sketchybar-app-font"
