# macOS packages NOT yet covered by nix-darwin / home-manager.
# Usage: brew bundle --file=config/Brewfile --no-lock
#
# Phase 6: all formulae that the Nix stack now provides have been moved
# out of this file. What remains:
#   - GUI apps (.app bundles) installed as casks — nix-darwin's casks
#     module is supported but deferred (see migration plan).
#   - Casks for which the Nix toolchain has no equivalent (raycast,
#     1Password app, etc.).
#   - A few custom-tap formulae that nixpkgs doesn't ship (see below).
#
# CLI binaries previously listed here are now declared in
# `nix/modules/packages/core.nix` (mac) and
# `nix/modules/packages/linux.nix` (linux) via home-manager.

# --- Taps (kept only if a cask below needs them) ---
# none required for the remaining casks; lemonade / keifu / rtk were
# CLI tools — those move to overlays in a follow-up if needed.

# --- macOS GUI apps (casks) ---
cask "ghostty"
cask "raycast"
cask "karabiner-elements"           # deferred from Phase 3b (services.karabiner-elements v15 instability)
cask "aerospace"
cask "font-sketchybar-app-font"

# --- macOS-specific menubar/UI binaries not in nixpkgs ---
# (These three live on the FelixKratz tap and have no nixpkgs equivalent
# as of nixpkgs-unstable 2026-05. Retain on brew until upstream lands.)
tap "FelixKratz/formulae"
brew "sketchybar"
brew "borders"
brew "macmon"

# --- Custom-tap CLI tools without nixpkgs equivalents ---
# Retain because nix overlays for these were out of scope through
# Phase 6. Migrate in a follow-up if/when needed.
tap "trasta298/tap"
brew "trasta298/tap/keifu"
brew "rtk"                          # AI-agent token compression CLI

# --- Mac-specific runtime helpers ---
brew "colima"                       # container runtime for Mac (lima VM)
brew "docker"                       # docker CLI (colima provides daemon)
brew "docker-compose"
brew "docker-credential-helper"     # osxkeychain credential store
brew "rainfrog"                     # TUI DB client (not in nixpkgs)
brew "fancy-cat"                    # terminal PDF viewer (not in nixpkgs)
